** Pooling

When a program contains a group of facts with the same predicate symbol, these facts can be "pooled together" using semicolons

#+begin_src prolog
size(france,65; german,83; italy,61; uk,64).
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from abrv.lp
Solving...
Answer: 1
size(france,65) size(german,83) size(italy,61) size(uk,64)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s

*** DONE Exercise 2.5

#+begin_src prolog Rule 2.2
parent(ann,bob). parent(bob,carol). parent(bob,dan).
#+end_src

Use pooling to abbreviate line (2.2)

#+begin_src prolog
parent(ann,bob; bob,carol; bob,dan).
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from abrv.lp
Solving...
Answer: 1
parent(ann,bob) parent(bob,carol) parent(bob,dan)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s

*** show

A ~#show~ directive instructs *CLINGO* to show some elements of the stable model and suppress others

#+begin_src prolog (1.3) output
size(france,65) size(germany,83) size(italy,61) size(uk,64)
large(france) large(germany)
#+end_src

E.g. in the output (1.3) of program (1.1) and (1.2) the first four atoms are irrelevant, they simply repeat the facts included in the program

The output of interest is the list of countries inhabited by more people than the UK, which is given by the last two atoms

*CLINGO* can be instructed to "hide" all atoms that do not begin with the predicate symbol ~large~

#+begin_src prolog
#show large/1
#+end_src

#+begin_src prolog
size(france,65; germany,83; italy,61; uk,64; russia,142).

large(C) :- size(C,S1), size(uk,S2), S1 > S2.

%stelligkeit mit dazu schreiben
%#show large/1.
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from sample3.lp
Solving...
Answer: 1
large(france) large(germany) large(russia)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.002s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s

In ~#show~ directives and in other cases when referring to /predicate symbols/ used in a logic program, the *arity* is appended =:=the number of arguments= after a slash

In this case the predicate is unary and its arity is ~1~
Specifying the arity is crucial because *CLINGO* allows to use the same character string to represent several predicate symbols on different arities

E.g.

#+begin_src clingo
p. p(a). p(a,b).
#show p/0. #show p/2.
#+end_src

clingo will drop the atom ~p(a)~ from the output, since its predicate symbol ~p/1~ is different from bot ~p/0~ and ~p/2~

#+RESULTS:
clingo version 5.6.2
Reading from show.lp
Solving...
Answer: 1
p p(a,b)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s

*** DONE Exercise 2.8

Write a one-rule program that does not contain pooling and has the same stable model as the program from exercise (2.6)

#+begin_src prolog 2.6
p(1,2; 2,4; 4,8; 8,16).
#+end_src

#+begin_src prolog 2.8
p(X, X*2) :- N = 1..8, N\2 == 0.
#+end_src

=OR=

#+begin_src prolog
p(2**N,2**(N+1)) :- N = 0..3.
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from one.lp
Solving...
Answer: 1
p(2,4) p(4,8) p(6,12) p(8,16)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s

*** DONE Exercise 2.9

For each of the given sets of ground atoms, write a one-rule program that does not contain pooling and has that set as its stable model

a. ~p(0,1) p(1,-1) p(2,1) p(3,-1) p(4,1)~

#+begin_src prolog
p(X,-1**X) :- X=0..4
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from one.lp
Solving...
Answer: 1
p(0,1) p(1,-1) p(2,1) p(3,-1) p(4,1)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.002s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.002s

b. p(1,1), p(2,1) p(2,2), p(3,1) p(3,2) p(3,3), p(4,1) p(4,2) p(4,3) p(4,4)

#+begin_src prolog
p(X,X>=X) :- X = 1..4.
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from one_b.lp
Solving...
Answer: 1
p(1,1) p(2,1) p(2,2) p(3,1) p(3,2) p(3,3) p(4,1) p(4,2) p(4,3) p(4,4)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s


Intervals may be used not only in the body of rules as in 2.7 but in the heads as well

E.g. a program containing the fact

    ~p(0..3).~

has the same meaning as the set of 4 facts

    ~p(0). p(1). p(2). p(3).~

And this group can also be abbreviated using pooling:

    ~p(0; 1; 2; 3).~

Each of the constructs, =intervals= or =pooling= has its advantages and limitations

E.g. This "table?" cannot be expressed using =intervals=

#+begin_src prolog
size(france ,65; germany ,83; italy ,61; uk ,64).
#+end_src

And on the other hand expressing a long interval such as ~p(1..100)~ by pooling is impractical

For example the stable model of this one-rule program consists of 64 atoms:

#+begin_src prolog
square(1..8, 1..8).
#+end_src

#+RESULT:
~square(1,1) ... square(8,8)~
            ...
~square(8,1) ... square(8,8)~

*** DONE Exercise 2.19

Listing 2.6 gives yet another example of a pair of definitions, one on top of the other.
Before defining the property ~fac/1~ of being a factorial, we give a recursive definition of the binary relation ~fac/2~, "the factorial of ~N~ is ~F~." Note that there is no "achieved" comment after Line 5.
Nothing of interest is achieved in the middle of a definition.
Exercise 2.19. Consider the part of the program shown in Listing 2.6 that precedes the comment in Line 7.
What atoms do you expect to see in its stable model if the value of n is 4?

#+begin_src prolog
% Factorials of numbers from 0 to n.

% input: nonnegative integer n.
fac(0 ,1).
fac(N+1,F*(N+1)) :- fac(N,F), N<n.
% achieved: fac/2 = {(0 ,0!) ,... ,(n,n !)}.

fac(F) :- fac(N,F).
% achieved: fac/1 = {0! ,... ,n!}.

#show fac/1.
#+end_src

#+RESULTS:
clingo version 5.6.2
Reading from fac.lp
Solving...
Answer: 1
fac(1) fac(2) fac(6) fac(24)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s
